uhnp/src/DataProcessors/УдалениеВидовОтчетов/УдалениеВидовОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УдалениеВидовОтчетов</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлементыСтруктуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыОтчетовДляУдаления</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/РеквизитыИсточниковДанныхДляФормул/РеквизитыИсточниковДанныхДляФормул.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыИсточниковДанныхДляФормул</name>
  <resources>
    <name>КодИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодУпрощеннойФормулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоказательОтбор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТекущегоОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьНестандартныеОтборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательОтбор</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>СдвигПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтчетаОтбор</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ТипЗначенияИсточника</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НазначениеРасчетов</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
      <types>CatalogRef.ПараметрическоеУсловие</types>
      <types>CatalogRef.ПравилаОбработки</types>
      <types>CatalogRef.ПравилаЗаполненияОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПотребительРасчета</name>
    <type>
      <types>CatalogRef.ПоказателиОбъектовБД</types>
      <types>CatalogRef.ПараметрическоеУсловие</types>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособыПолученияОперандов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособИспользования</name>
    <type>
      <types>EnumRef.СпособыИспользованияОперандов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ГруппыРаскрытия/ГруппыРаскрытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыРаскрытия</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <owners>Catalog.ШаблоныТрансляций</owners>
  <attributes>
    <name>Аналитика1Обязательна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2Обязательна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3Обязательна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4Обязательна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5Обязательна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6Обязательна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <comment>Только для использования в показателях отчетов типа &quot;Трансформационная корректировка&quot;</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаВГО</name>
    <comment>Аналитика организации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоАналитикДт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоАналитикКт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиВалютаДт</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиВалютаКт</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытияСтатья</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      <types>CatalogRef.ГруппыАналитикСтатьи</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаКонтрагент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоговорКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаЭтапПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВидыДвижений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаОтображенияПолей</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьВМакете</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылочное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МультиязычныйРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАналитики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВидаОтчета</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПротоколируемыеСобытия/ПротоколируемыеСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПротоколируемыеСобытия</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
      <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФайлИмпорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реструктуризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеРеструктуризации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Записи</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписи</name>
      <type>
        <types>EnumRef.ТипыЗаписейПротоколируемыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
        <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>280</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехническаяИнформацияСтрокаВнутр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяMs</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтекстСобытия</name>
      <type>
        <types>EnumRef.КонтекстПротоколируемогоСобытия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/УдалениеВидовОтчетов/Forms/Форма/Module.bsl
&НаСервере
Функция ПроверитьЗависимыеВидыОтчетов()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	РеквизитыИсточниковДанныхДляФормул.ВидОтчета КАК ВидОтчета
	|ИЗ
	|	РегистрСведений.РеквизитыИсточниковДанныхДляФормул КАК РеквизитыИсточниковДанныхДляФормул
	|ГДЕ
	|	НЕ РеквизитыИсточниковДанныхДляФормул.ВидОтчета В (&ВидыОтчетов)
	|	И РеквизитыИсточниковДанныхДляФормул.ВидОтчетаОтбор В(&ВидыОтчетов)
	|	И НЕ(РеквизитыИсточниковДанныхДляФормул.НеИспользуется
	|				ИЛИ РеквизитыИсточниковДанныхДляФормул.ВидОтчета = ЗНАЧЕНИЕ(Справочник.ВидыОтчетов.ПустаяСсылка)
	|				ИЛИ РеквизитыИсточниковДанныхДляФормул.ВидОтчетаОтбор = ЗНАЧЕНИЕ(Справочник.ВидыОтчетов.ПустаяСсылка))";
	
	
	ВидыОтчетов=Объект.ВидыОтчетовДляУдаления.Выгрузить().ВыгрузитьКолонку("ВидОтчета");
	Запрос.УстановитьПараметр("ВидыОтчетов",ВидыОтчетов);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат ВидыОтчетов;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции // ПроверитьЗависимыеВидыОтчетов()

&НаСервере
Процедура ОпределитьПолеСсылки(СтрокаЗаписи,Данные)
	
	МетаданныеРегистра=Метаданные.НайтиПоПолномуИмени(СтрокаЗаписи.ИмяРегистра);
	
	СтруктураДанные=Новый Структура;
	
	Для Каждого Измерение ИЗ МетаданныеРегистра.Измерения Цикл
		
		Если Данные[Измерение.Имя]=СтрокаЗаписи.СсылаетсяНа Тогда
			
			СтрокаЗаписи.ТипПоля="Измерение";
			СтрокаЗаписи.ИмяПоля=Измерение.Имя;
			Возврат;
			
		КонецЕсли;
		
		СтруктураДанные.Вставить(Измерение.Имя,Данные[Измерение.Имя]);
		
	КонецЦикла;
	
	НаборЗаписей=РегистрыСведений[МетаданныеРегистра.Имя].СоздатьНаборЗаписей();
	
	Для Каждого Элемент ИЗ СтруктураДанные Цикл
		
		НаборЗаписей.Отбор[Элемент.Ключ].Установить(Элемент.Значение);
		
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаНабора=НаборЗаписей[0];
	
	Для Каждого Ресурс ИЗ МетаданныеРегистра.Ресурсы Цикл
		
		Если СтрокаНабора[Ресурс.Имя]=СтрокаЗаписи.СсылаетсяНа Тогда
			
			СтрокаЗаписи.ТипПоля="Ресурс";
			СтрокаЗаписи.ИмяПоля=Ресурс.Имя;
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Реквизит ИЗ МетаданныеРегистра.Реквизиты Цикл
		
		Если СтрокаНабора[Реквизит.Имя]=СтрокаЗаписи.СсылаетсяНа Тогда
			
			СтрокаЗаписи.ТипПоля="Реквизит";
			СтрокаЗаписи.ИмяПоля=Реквизит.Имя;
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОпределитьПолеСсылки()

Процедура ОчиститьТаблицыИнтерфейса()

	ТаблицаДокументы.Очистить();
	ТаблицаСправочники.Очистить();
	ТаблицаРегистрыСведений.Очистить();
	ДеревоЗависимых.ПолучитьЭлементы().Очистить();
	
	Элементы.ЗависимыеДокументы.Заголовок=Нстр("ru = 'Документы'");
	Элементы.ЗависимыеСправочники.Заголовок=Нстр("ru = 'Справочники'");
	Элементы.ЗависимыеРегистрыСведений.Заголовок=Нстр("ru = 'Регистры сведений'");
	Элементы.ГруппаЗависимыеОбъекты.Заголовок=Нстр("ru = 'Зависимые объекты'");
	
КонецПроцедуры // ОчиститьТаблицыИнтерфейса() 

&НаСервере
Функция ВыполнитьПоискНаСервере()
	
	ОчиститьТаблицыИнтерфейса();
	РезультатПроверки=ПроверитьЗависимыеВидыОтчетов();
	
	Если Не РезультатПроверки=Неопределено Тогда
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
	
	ОбработкаОбъект=РеквизитФормыВЗначение("Объект");
	ТабДеревоЗависимых=ОбработкаОбъект.ПостроитьДеревоСсылок();
	
	МассивИсточников=ПолучитьИсточникиКУдалению();
		
	ЭлементыСтруктуры=Новый Массив;
	ЭлементыСтруктуры.Добавить("Справочник.ПоказателиОтчетов");
	ЭлементыСтруктуры.Добавить("Справочник.БланкиОтчетов");
	ЭлементыСтруктуры.Добавить("Справочник.КолонкиОтчетов");
	ЭлементыСтруктуры.Добавить("Справочник.СтрокиОтчетов");
	ЭлементыСтруктуры.Добавить("Справочник.ГруппыРаскрытия");
	ЭлементыСтруктуры.Добавить("Справочник.ПоказателиОтчетов");
	ЭлементыСтруктуры.Добавить("Справочник.ПравилаОбработки");
	ЭлементыСтруктуры.Добавить("Справочник.ПравилаПроверки");
	ЭлементыСтруктуры.Добавить("Справочник.ПротоколируемыеСобытия");
	ЭлементыСтруктуры.Добавить("Справочник.ОбластиДанныхВидовОтчетов");
	ЭлементыСтруктуры.Добавить("Справочник.НастройкиСтруктурыБланка");


	МассивДокументы=ТабДеревоЗависимых.Строки.НайтиСтроки(Новый Структура("ТипОбъектаМетаданных","Документ"),Истина);
		
	Для Каждого Строка ИЗ МассивДокументы Цикл
		
		НоваяСтрока=ТаблицаДокументы.Добавить();
		НоваяСтрока.ДокументСсылка=Строка.Данные;
		НоваяСтрока.СсылаетсяНа=Строка.Ссылка;
		НоваяСтрока.СсылкаМетаданные=Строка.Ссылка.Метаданные().ПолноеИмя();
		НоваяСтрока.ПометкаУдаления=Строка.ПометкаУдаления;
		НоваяСтрока.ИмяОбъектаМетаданных=Строка.ИмяОбъектаМетаданных;
		
	КонецЦикла;
	
	Элементы.ЗависимыеДокументы.Заголовок=Элементы.ЗависимыеДокументы.Заголовок + " ("+ТаблицаДокументы.Количество()+")";
	
	МассивСправочники=ТабДеревоЗависимых.Строки.НайтиСтроки(Новый Структура("ТипОбъектаМетаданных","Справочник"),Истина);
		
	Для Каждого Строка ИЗ МассивСправочники Цикл
		
		Если НЕ ЭлементыСтруктуры.Найти(Строка.ИмяОбъектаМетаданных)=Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Строка.ИмяОбъектаМетаданных="Справочник.ИсточникиДанныхДляРасчетов"
			И (НЕ МассивИсточников.Найти(Строка.Данные)=Неопределено) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока=ТаблицаСправочники.Добавить();
		НоваяСтрока.СправочникСсылка=Строка.Данные;
		НоваяСтрока.СсылаетсяНа=Строка.Ссылка;
		НоваяСтрока.СсылкаМетаданные=Строка.Ссылка.Метаданные().ПолноеИмя();
		НоваяСтрока.ИмяОбъектаМетаданных=Строка.ИмяОбъектаМетаданных;
		НоваяСтрока.ПометкаУдаления=Строка.ПометкаУдаления;
		
	КонецЦикла;
	
	МассивПВХ=ТабДеревоЗависимых.Строки.НайтиСтроки(Новый Структура("ТипОбъектаМетаданных","ПланВидовХарактеристик"),Истина);
		
	Для Каждого Строка ИЗ МассивПВХ Цикл
				
		НоваяСтрока=ТаблицаСправочники.Добавить();
		НоваяСтрока.СправочникСсылка=Строка.Данные;
		НоваяСтрока.СсылаетсяНа=Строка.Ссылка;
		НоваяСтрока.СсылкаМетаданные=Строка.Ссылка.Метаданные().ПолноеИмя();
		НоваяСтрока.ИмяОбъектаМетаданных=Строка.ИмяОбъектаМетаданных;
		НоваяСтрока.ПометкаУдаления=Строка.ПометкаУдаления;
		
	КонецЦикла;
	
	Элементы.ЗависимыеСправочники.Заголовок=Элементы.ЗависимыеСправочники.Заголовок + " ("+ТаблицаСправочники.Количество()+")";
	
	ТабРегистры=РеквизитФормыВЗначение("ТаблицаРегистрыСведений");
	
	МассивРегистры=ТабДеревоЗависимых.Строки.НайтиСтроки(Новый Структура("ТипОбъектаМетаданных","РегистрСведений"),Истина);
		
	Для Каждого Строка ИЗ МассивРегистры Цикл
		
		НоваяСтрока=ТабРегистры.Добавить();
		НоваяСтрока.ИмяРегистра=Строка.ИмяОбъектаМетаданных;
		НоваяСтрока.СсылаетсяНа=Строка.Ссылка;
		НоваяСтрока.СсылкаМетаданные=Строка.Ссылка.Метаданные().ПолноеИмя();
		
		ОпределитьПолеСсылки(НоваяСтрока,Строка.Данные);
		
	КонецЦикла;
	
	ТабРегистры.Свернуть("ИмяРегистра,СсылаетсяНа,СсылкаМетаданные,НеУдалять,ТипПоля,ИмяПоля");
	
	ЗначениеВРеквизитФормы(ТабРегистры,"ТаблицаРегистрыСведений");
	
	Элементы.ЗависимыеРегистрыСведений.Заголовок=Элементы.ЗависимыеРегистрыСведений.Заголовок + " ("+ТаблицаРегистрыСведений.Количество()+")";
	
	Элементы.ГруппаЗависимыеОбъекты.Заголовок=Элементы.ГруппаЗависимыеОбъекты.Заголовок + " ("+
			(ТаблицаДокументы.Количество()+
			ТаблицаСправочники.Количество()+
			ТаблицаРегистрыСведений.Количество())+")";
	
	ЗначениеВРеквизитФормы(ТабДеревоЗависимых,"ДеревоЗависимых");
	
	Возврат "";
	
КонецФункции // ВыполнитьПоискНаСервере() 

&НаСервере
Функция НайтиЗависимыеМетаданные(ТипДляПоиска,ОбъектДляПоиска)
	
	МассивМетаданных=Новый Массив;
	
	Для Каждого ОбъектМетаданных ИЗ Метаданные.Справочники Цикл
		
		ПроверитьВхождениеСправочник(МассивМетаданных,"Справочник",ОбъектМетаданных,ТипДляПоиска,ОбъектДляПоиска);
		
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных ИЗ Метаданные.Документы Цикл
		
		ПроверитьВхождениеСправочник(МассивМетаданных,"Документ",ОбъектМетаданных,ТипДляПоиска,ОбъектДляПоиска);
		
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных ИЗ Метаданные.ПланыВидовХарактеристик Цикл
		
		ПроверитьВхождениеСправочник(МассивМетаданных,"ПланВидовХарактеристик",ОбъектМетаданных,ТипДляПоиска,ОбъектДляПоиска);
		
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных ИЗ Метаданные.РегистрыСведений Цикл
		
		ПроверитьВхождениеРегистр(МассивМетаданных,"РегистрСведений",ОбъектМетаданных,ТипДляПоиска,ОбъектДляПоиска);
		
	КонецЦикла;
	
	Возврат МассивМетаданных;
		
КонецФункции // НайтиЗависимыеМетаданные()

&НаСервере
Процедура ПроверитьВхождениеСправочник(МассивМетаданных,ТипОбъектаМетаданных,ОбъектМетаданных,ТипДляПоиска,ОбъектДляПоиска)
	
	Для Каждого Реквизит ИЗ ОбъектМетаданных.Реквизиты Цикл
		
		Если СтрНайти(Реквизит.Имя,"Субконто")>0 Тогда
				
				Продолжить;
				
			КонецЕсли;
		
		Если Реквизит.Тип.СодержитТип(ТипДляПоиска) И МассивМетаданных.Найти(ОбъектМетаданных.ПолноеИмя())=Неопределено Тогда
			
			МассивМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
			Возврат;
						
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого ТабличнаяЧасть ИЗ ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Для Каждого РеквизитТЧ ИЗ ТабличнаяЧасть.Реквизиты Цикл
			
			Если СтрНайти(РеквизитТЧ.Имя,"Субконто")>0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если РеквизитТЧ.Тип.СодержитТип(ТипДляПоиска) И МассивМетаданных.Найти(ОбъектМетаданных.ПолноеИмя())=Неопределено Тогда
				
				МассивМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
				Возврат;
	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
	Если ТипОбъектаМетаданных="Справочник" Тогда
		
		Для Каждого Владелец ИЗ ОбъектМетаданных.Владельцы Цикл
			
			Если Владелец=ОбъектДляПоиска И МассивМетаданных.Найти(ОбъектМетаданных.ПолноеИмя())=Неопределено Тогда
				
				МассивМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
				Возврат;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры  // ПроверитьВхождениеСправочник()

&НаСервере
Процедура ПроверитьВхождениеРегистр(МассивМетаданных,ТипОбъектаМетаданных,ОбъектМетаданных,ТипДляПоиска,ОбъектДляПоиска)
	
	Для Каждого Измерение ИЗ ОбъектМетаданных.Измерения Цикл
		
		Если Измерение.Тип.СодержитТип(ТипДляПоиска)  И МассивМетаданных.Найти(ОбъектМетаданных.ПолноеИмя())=Неопределено Тогда
			
			МассивМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого Ресурс ИЗ ОбъектМетаданных.Ресурсы Цикл
		
		Если Ресурс.Тип.СодержитТип(ТипДляПоиска)  И МассивМетаданных.Найти(ОбъектМетаданных.ПолноеИмя())=Неопределено Тогда
			
			МассивМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Для Каждого Реквизит ИЗ ОбъектМетаданных.Реквизиты Цикл
		
		Если Реквизит.Тип.СодержитТип(ТипДляПоиска) И МассивМетаданных.Найти(ОбъектМетаданных.ПолноеИмя())=Неопределено Тогда
			
			МассивМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры  // ПроверитьВхождениеСправочник()

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	
	РезультатПоиска=ВыполнитьПоискНаСервере();
	
	Если ТипЗнч(РезультатПоиска)=Тип("Массив") Тогда
		
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("МассивВидовОтчетов",РезультатПоиска);
		СтруктураПараметров.Вставить("СпособСопоставления",2);
		СтруктураПараметров.Вставить("СпособГруппировки",2);
		СтруктураПараметров.Вставить("ТекстСообщения",Нстр("ru = 'Существуют виды отчетов, данные которых зависят от удаляемых.'"));
		
		ОткрытьФорму("Отчет.ОтчетОСвязяхМеждуОтчетами.Форма",СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ЭтоГруппа", Истина));
	ГруппаОтчетов = Неопределено;

	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыборГруппыОтчетов", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыОтчетов.ФормаВыбора", 
					ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборГруппыОтчетов(Результат, ДополнительныеПараметры) Экспорт
    
    ГруппаОтчетов = Результат;
    
    Если ГруппаОтчетов <> Неопределено Тогда
                
        ЗаполнитьТаблицуОтборов(ГруппаОтчетов);
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьИсточникиКУдалению()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсточникиДанныхДляРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	|ГДЕ
	|	ИсточникиДанныхДляРасчетов.НазначениеРасчетов.Владелец В(&ВидыОтчетовКУдалению)";
	
	Запрос.УстановитьПараметр("ВидыОтчетовКУдалению",Объект.ВидыОтчетовДляУдаления.Выгрузить().ВыгрузитьКолонку("ВидОтчета"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
КонецФункции // ПолучитьИсточникиКУдалению()

&НаСервере
Процедура ЗаполнитьТаблицуОтборов(Параметр)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметр);	
	Запрос.УстановитьПараметр("ОтборОтчетов", РеквизитФормыВЗначение("Объект.ВидыОтчетовДляУдаления").Выгрузить().ВыгрузитьКолонку("ВидОтчета"));
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВидыОтчетов.Ссылка КАК Отчет
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И НЕ ВидыОтчетов.Ссылка В (&ОтборОтчетов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыОтчетов.Наименование";
		
	ИначеЕсли ТипЗнч(Параметр) = Тип("Булево") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВидыОтчетов.Ссылка КАК Отчет
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	НЕ ВидыОтчетов.Ссылка В (&ОтборОтчетов)
		|	И ВидыОтчетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыОтчетов.Наименование";
					   
	КонецЕсли;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НоваяСтрока=Объект.ВидыОтчетовДляУдаления.Добавить();
		НоваяСтрока.ВидОтчета=Результат.Отчет;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПомеченные(Команда)
	
	ЗаполнитьТаблицуОтборов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	ПоказатьЗначение(,Элементы.ТаблицаДокументов.ТекущиеДанные[СтрЗаменить(Поле.Имя,"ТаблицаДокументов","")]);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСправочникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя="СправочникСсылка" Или Поле.Имя="СсылаетсяНа" Тогда
		
		ПоказатьЗначение(,Элементы.ТаблицаСправочники.ТекущиеДанные[Поле.Имя]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимыхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элементы.ДеревоЗависимых.ТекущиеДанные.Данные);
			
КонецПроцедуры

&НаСервере
Процедура УдалитьОбъектыНаСервере()
	
	ОбработкаОбъект=РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ТаблицаДокументы=РеквизитФормыВЗначение("ТаблицаДокументы");
	ОбработкаОбъект.ТаблицаРегистрыСведений=РеквизитФормыВЗначение("ТаблицаРегистрыСведений");
	ОбработкаОбъект.ТаблицаСправочники=РеквизитФормыВЗначение("ТаблицаСправочники");
	ОбработкаОбъект.ДеревоЗависимых=РеквизитФормыВЗначение("ДеревоЗависимых");
	
	Если ОбработкаОбъект.ВыполнитьУдаление() Тогда
		
		ОчиститьТаблицыИнтерфейса();
		Объект.ВидыОтчетовДляУдаления.Очистить();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СформироватьТекстПредупреждения()
	
	ТекстПредупреждения=Нстр("ru = 'Процедура удаления является необратимой.'")+Символы.ПС+
				Нстр("ru = 'Помимо элементов настройки модели, будут удалены следующие объекты:'");
				
	ТекстОбъекты="";
	
	ДокументыКУдалению=ТаблицаДокументы.НайтиСтроки(Новый Структура("НеУдалять",Ложь));
	
	Если ДокументыКУдалению.Количество()>0 Тогда
		
		ТекстОбъекты=ТекстОбъекты+Символы.ПС+Нстр("ru = 'Документы: '")+ДокументыКУдалению.Количество();
		
	КонецЕсли;
	
	СправочникиКУдалению=ТаблицаСправочники.НайтиСтроки(Новый Структура("НеУдалять",Ложь));
	
	Если СправочникиКУдалению.Количество()>0 Тогда
		
		ТекстОбъекты=ТекстОбъекты+Символы.ПС+Нстр("ru = 'Справочники: '")+СправочникиКУдалению.Количество();
		
	КонецЕсли;
	
	РегистрыКУдалению=ТаблицаРегистрыСведений.НайтиСтроки(Новый Структура("НеУдалять",Ложь));
	
	Если РегистрыКУдалению.Количество()>0 Тогда
		
		ТекстОбъекты=ТекстОбъекты+Символы.ПС+Нстр("ru = 'Связанные наборы записей регистров: '")+РегистрыКУдалению.Количество();
		
	КонецЕсли;
	
	ТекстПредупреждения=ТекстПредупреждения+ТекстОбъекты+Символы.ПС+Нстр("ru = 'Продолжить?'");
	
	Возврат ТекстПредупреждения;
	
КонецФункции // СформироватьТекстПредупреждения() 

&НаКлиенте
Процедура УдалитьВыбранныеОбъекты(Команда)
	
	ТекстПредупреждения=СформироватьТекстПредупреждения();
	
	ОписаниеЗакрытие = Новый ОписаниеОповещения("ПередУдалением_Завершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеЗакрытие, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередУдалением_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьОбъектыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОтбора(ИмяОбъектаМетаданных,Ссылка)
	
	МассивПолей=Новый Массив;
	
	ТипДляПоиска=ТипЗнч(Ссылка);
	ОбъектМетаданных=Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных);
	
	Для Каждого Измерение ИЗ ОбъектМетаданных.Измерения Цикл
		
		Если Измерение.Тип.СодержитТип(ТипДляПоиска) Тогда
			
			МассивПолей.Добавить(Измерение.Имя);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого Ресурс ИЗ ОбъектМетаданных.Ресурсы Цикл
		
		Если Ресурс.Тип.СодержитТип(ТипДляПоиска) Тогда
			
			МассивПолей.Добавить(Ресурс.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
		
	Для Каждого Реквизит ИЗ ОбъектМетаданных.Реквизиты Цикл
		
		Если Реквизит.Тип.СодержитТип(ТипДляПоиска) Тогда
			
			МассивПолей.Добавить(Ресурс.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрПоле ИЗ МассивПолей Цикл
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ Первые 1
		|РегистрДляПоиска."+СтрПоле+"
		|ИЗ " + ИмяОбъектаМетаданных + " КАК РегистрДляПоиска
		|ГДЕ РегистрДляПоиска."+СтрПоле+"=&Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить(СтрПоле,Ссылка);
			Возврат СтруктураОтбора;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // ПолучитьСтруктуруОтбора() 


&НаКлиенте
Процедура ТаблицаРегистрыСведенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные=Элементы.ТаблицаРегистрыСведений.ТекущиеДанные;
	
	СтруктураОтбора=ПолучитьСтруктуруОтбора(ТекущиеДанные.ИмяРегистра,ТекущиеДанные.СсылаетсяНа);
	СтруктураПараметров=Новый Структура;
	
	Если НЕ СтруктураОтбора=Неопределено Тогда
		
		СтруктураПараметров.Вставить("Отбор",СтруктураОтбора);
		
	КонецЕсли;
	
	ОткрытьФорму(Элементы.ТаблицаРегистрыСведений.ТекущиеДанные.ИмяРегистра+".ФормаСписка",СтруктураПараметров);

	
КонецПроцедуры
